eduardofabbris/error_detection/psoc6_dut.cydsn/codegentemp/DMA1.h
/***************************************
*    Global Variables
***************************************/
extern uint8_t DMA1_initVar;

extern const cy_stc_dma_descriptor_config_t DMA1_Descriptor_1_config;
extern cy_stc_dma_descriptor_t DMA1_Descriptor_1;



/***************************************
*    In-line Function Implementation
***************************************/

/*******************************************************************************
* Function Name: DMA1_Stop
****************************************************************************//**
* Invokes the Cy_DMA_Channel_Disable() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA1_Stop(void)
{
    Cy_DMA_Channel_Disable(DMA1_HW, DMA1_DW_CHANNEL);
}


/*******************************************************************************
* Function Name: DMA1_ChannelEnable
****************************************************************************//**
* Invokes the Cy_DMA_Channel_Enable() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA1_ChannelEnable(void)
{
    Cy_DMA_Channel_Enable(DMA1_HW, DMA1_DW_CHANNEL);
}


/*******************************************************************************
* Function Name: DMA1_ChannelDisable
****************************************************************************//**
* Invokes the Cy_DMA_Channel_Disable() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA1_ChannelDisable(void)
{
    Cy_DMA_Channel_Disable(DMA1_HW, DMA1_DW_CHANNEL);
}


/*******************************************************************************
* Function Name: DMA1_SetDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Channel_SetDescriptor() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA1_SetDescriptor(cy_stc_dma_descriptor_t const * descriptor)
{
    Cy_DMA_Channel_SetDescriptor(DMA1_HW, DMA1_DW_CHANNEL, descriptor);
}


/*******************************************************************************
* Function Name: DMA1_GetDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Channel_GetCurrentDescriptor() PDL driver function.
*******************************************************************************/
__STATIC_INLINE cy_stc_dma_descriptor_t * DMA1_GetDescriptor(void)
{
    return(Cy_DMA_Channel_GetCurrentDescriptor(DMA1_HW, DMA1_DW_CHANNEL));
}


/*******************************************************************************
* Function Name: DMA1_SetNextDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_SetNextDescriptor() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA1_SetNextDescriptor(cy_stc_dma_descriptor_t const * descriptor)
{
    Cy_DMA_Descriptor_SetNextDescriptor(Cy_DMA_Channel_GetCurrentDescriptor(DMA1_HW, DMA1_DW_CHANNEL), descriptor);
}


/*******************************************************************************
* Function Name: DMA1_GetNextDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_GetNextDescriptor() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE cy_stc_dma_descriptor_t * DMA1_GetNextDescriptor(void)
{
    return(Cy_DMA_Descriptor_GetNextDescriptor(Cy_DMA_Channel_GetCurrentDescriptor(DMA1_HW, DMA1_DW_CHANNEL)));
}


/*******************************************************************************
* Function Name: DMA1_SetPriority
****************************************************************************//**
* Invokes the Cy_DMA_Channel_SetPriority() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA1_SetPriority(uint32_t priority)
{
    Cy_DMA_Channel_SetPriority(DMA1_HW, DMA1_DW_CHANNEL, priority);
}


/*******************************************************************************
* Function Name: DMA1_GetPriority
****************************************************************************//**
* Invokes the Cy_DMA_Channel_GetPriority() PDL driver function.  
*******************************************************************************/
__STATIC_INLINE uint32_t DMA1_GetPriority(void)
{
    return (Cy_DMA_Channel_GetPriority(DMA1_HW, DMA1_DW_CHANNEL));
}


/*******************************************************************************
* Function Name: DMA1_SetSrcAddress
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_SetSrcAddress() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA1_SetSrcAddress(cy_stc_dma_descriptor_t * descriptor, void const * srcAddress)
{
    Cy_DMA_Descriptor_SetSrcAddress(descriptor, srcAddress);
}


/*******************************************************************************
* Function Name: DMA1_GetSrcAddress
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_GetSrcAddress() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void * DMA1_GetSrcAddress(cy_stc_dma_descriptor_t const * descriptor)
{
    return(Cy_DMA_Descriptor_GetSrcAddress(descriptor));
}


/*******************************************************************************
* Function Name: DMA1_SetDstAddress
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_SetDstAddress() PDL driver function.
*******************************************************************************/
__STATIC_INLINE void DMA1_SetDstAddress(cy_stc_dma_descriptor_t * descriptor, void const * dstAddress)
{
    Cy_DMA_Descriptor_SetDstAddress(descriptor, dstAddress);
}


